{
    "educations": [
        {
            "id": "edu-2",
            "school": "New York Institute of Technology",
            "degree": "Computer Science, B.S.",
            "duration": "Sep 2009 - May 2014",
            "content": [
                "GPA: 3.0"
            ]
        }
    ],
    "experiences": [
        {
            "id": "exp-1",
            "company": "Blue Acorn iCi",
            "position": "Front End Software Engineer",
            "duration": "Aug 2022 - Aug 2023",
            "description": [
                "Implemented a solution for the Cumulative Layout Shift (CLS) score to drop from 0.23 to 0.05, which improved the page load speed for the Home page, Product Description page, and Collections page, across mobile and desktop devices​",
                "Built a Gift With Purchase feature with React.js for premium members, this feature led to more conversions from premium members",
                "Solved a bug in the legacy Shopify CLI that was preventing new team members on M Macs from getting their Development up and running quickly",
                "Built a “Product Added To Cart” toast notifications for mobile devices with React.js, which improved overall conversions on mobile and reduced abandoned cart issues on mobile by 7%"
            ]
        },
        {
            "id": "exp-2",
            "company": "The Stable BVA",
            "position": "Front End Engineer",
            "duration": "Feb 2021 - Jul 2022",
            "description": [
                "Built custom software solutions on the Shopify Plus platform, which allowed top DTC Brands such as OOFOS, Chubbies Shorts, YLANG 23, and more to sell their products and services to thousands of customers worldwide.​",
                "Migrated the entire codebase of the Chubbies store from an old CSS, jQuery, and outdated plugins codebase to Modern SASS, JavaScript ES6, React.js, and the Shopify 2.0 CLI",
                "Debugged and tested out the client's Shopify stores regularly to enhance overall performance"
            ]
        },
        {
            "id": "exp-3",
            "company": "Blue Acorn iCi",
            "position": "Front End Software Engineer(Contract)",
            "duration": "Oct 2020 - Jan 2021",
            "description": [
                "Built part of the “Buy Now Pay Later” feature for the Bluemercury cosmetic DTC brand, which resulted in $2.5 million in sales for the 2020 Black Friday Weekend​",
                "Built the Homepage, Collections page, and Product Description for the Amala Beauty DTC brand"
            ]
        },
        {
          "id": "exp-4",
          "company": "RPM",
          "position": "Full Stack Web Engineer",
          "duration": "Sep 2019 - Sep 2020",
          "description": [
              "Built custom WordPress Themes for famous Broadways plays such as Hamilton, Mrs. Doubtfire & Waitress ​",
              "Built a custom WordPress Plugin that allowed Marketers and Editors to create custom templates to run marketing campaigns and edit content on the fly."
          ]
      },
      {
        "id": "exp-5",
        "company": "Crain Communications",
        "position": "Full Stack Web Developer",
        "duration": "Jun 2018 - Aug 2019",
        "description": [
            "Developed a variety of responsive websites for all Crain brands using a PHP/MYSQL-based custom CMS. ​",
            "Built a custom WYSIWYG tool for the Adage Marketing team to run marketing campaigns, which resulted in more pay subscriber conversions."
        ]
      },
      {
        "id": "exp-6",
        "company": "Vibelyst, Inc",
        "position": "Junior Front End Engineer",
        "duration": "Jan 2017 - May 2018",
        "description": [
            "Built & implemented new features based on user requirements & functional specs for the Vibelyst platform ​",
            "Built reusable modular interactive UI Components using JavaScript/SASS/BEM and other methodologies",
            "Provided support for the marketing team in their project needs & other requirements"
        ]
      }
    ],
    "skills": [
        {
            "title": "Software Dev Skills: ",
            "tools": [
                "JavaScript ES6+",
                "TypeScript",
                "React.js",
                "Redux.js",
                "Next.js",
                "HTML5/CSS3",
                "SQL",
                "Tailwind CSS",
                "GraphQL"
            ]
        },
        {
            "title": "OS & Tools",
            "tools": ["MacOS", "Linux", "Git/GitHub", "Agile (Scrum)", "JIRA", "iTerm/Terminal", "VS Code", "Figma", "Vercel"]
        }
    ],
    "blog": [
        {
            "id": "blog-1",
            "title": "A beginner's guide to github",
            "link": "https://hrishikeshpaul12.medium.com/a-beginners-guide-to-github-a811e662a777"
        },
        {
            "id": "blog-2",
            "title": "User Experience Design – A little more than just design",
            "link": "https://hrishikeshpaul12.medium.com/user-experience-design-a-little-more-than-just-design-afdb941aeb5"
        }
    ]
}
